; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=37, out_folder=htg/blocksworld/training, instance_id=17, seed=2041, goal_proportion=0.1

(define (problem blocksworld-17)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 - object)
 (:init 
    (arm-empty)
    (clear b31)
    (on b31 b1)
    (on b1 b21)
    (on-table b21)
    (clear b26)
    (on b26 b8)
    (on b8 b12)
    (on b12 b2)
    (on-table b2)
    (clear b32)
    (on b32 b35)
    (on b35 b23)
    (on b23 b6)
    (on b6 b36)
    (on-table b36)
    (clear b14)
    (on-table b14)
    (clear b24)
    (on-table b24)
    (clear b33)
    (on b33 b7)
    (on b7 b25)
    (on b25 b22)
    (on b22 b15)
    (on b15 b17)
    (on b17 b27)
    (on-table b27)
    (clear b28)
    (on b28 b19)
    (on b19 b4)
    (on b4 b10)
    (on b10 b11)
    (on-table b11)
    (clear b13)
    (on b13 b34)
    (on-table b34)
    (clear b5)
    (on b5 b18)
    (on b18 b37)
    (on b37 b16)
    (on b16 b30)
    (on-table b30)
    (clear b9)
    (on-table b9)
    (clear b20)
    (on b20 b29)
    (on b29 b3)
    (on-table b3))
 (:goal  (and 
    (clear b1)
    (on b1 b2)
    (on b2 b3)
    (on-table b3))))

; plan
1. (unstack b31 b1)
   deleted: (on b31 b1) (clear b31) (arm-empty)
   added: (holding b31) (clear b1)
   goals met: 2 of 4
2. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 2 of 4
3. (unstack b20 b29)
   deleted: (on b20 b29) (clear b20) (arm-empty)
   added: (holding b20) (clear b29)
   goals met: 2 of 4
4. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 2 of 4
5. (unstack b26 b8)
   deleted: (on b26 b8) (clear b26) (arm-empty)
   added: (holding b26) (clear b8)
   goals met: 2 of 4
6. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 2 of 4
7. (unstack b8 b12)
   deleted: (on b8 b12) (clear b8) (arm-empty)
   added: (holding b8) (clear b12)
   goals met: 2 of 4
8. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 4
9. (unstack b29 b3)
   deleted: (on b29 b3) (clear b29) (arm-empty)
   added: (holding b29) (clear b3)
   goals met: 2 of 4
10. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 2 of 4
11. (unstack b12 b2)
   deleted: (on b12 b2) (clear b12) (arm-empty)
   added: (holding b12) (clear b2)
   goals met: 2 of 4
12. (stack b12 b33)
   deleted: (clear b33) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b33)
   goals met: 2 of 4
13. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 2 of 4
14. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 3 of 4
15. (unstack b1 b21)
   deleted: (on b1 b21) (clear b1) (arm-empty)
   added: (holding b1) (clear b21)
   goals met: 2 of 4
16. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 4 of 4
